 <div class="row">
        <div class="col-lg-9">
            <h1>1075.Project Employees I</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Table:&nbsp;<code>Project1075</code></p>

<pre>
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| project_id  | int     |
| employee_id | int     |
+-------------+---------+
(project_id, employee_id) is the primary key of this table.
employee_id is a foreign key to <code>Employee</code> table.
</pre>

<p>Table:&nbsp;<code>Employee1075</code></p>

<pre>
+------------------+---------+
| Column Name      | Type    |
+------------------+---------+
| employee_id      | int     |
| name             | varchar |
| experience_years | int     |
+------------------+---------+
employee_id is the primary key of this table.
</pre>

<p>&nbsp;</p>

<p>Write an SQL query that reports the <strong>average</strong>&nbsp;experience years of all the employees for each project, <strong>rounded to 2 digits</strong>.</p>

<p>The query result format is in the following example:</p>

<pre>
Project table:
+-------------+-------------+
| project_id  | employee_id |
+-------------+-------------+
| 1           | 1           |
| 1           | 2           |
| 1           | 3           |
| 2           | 1           |
| 2           | 4           |
+-------------+-------------+

Employee table:
+-------------+--------+------------------+
| employee_id | name   | experience_years |
+-------------+--------+------------------+
| 1           | Khaled | 3                |
| 2           | Ali    | 2                |
| 3           | John   | 1                |
| 4           | Doe    | 2                |
+-------------+--------+------------------+

Result table:
+-------------+---------------+
| project_id  | average_years |
+-------------+---------------+
| 1           | 2.00          |
| 2           | 2.50          |
+-------------+---------------+
The average experience years for the first project is (3 + 2 + 1) / 3 = 2.00 and for the second project is (3 + 2) / 2 = 2.50
</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [3]:
Employee = pd.read_sql_table("employee1075", engine)
Employee

   employee_id name  experience_years
0            1    A                 3
1            2    B                 2
2            3    C                 1
3            4    D                 2

In [4]:
Project = pd.read_sql_table("Project1075", engine)
Employee

   employee_id name  experience_years
0            1    A                 3
1            2    B                 2
2            3    C                 1
3            4    D                 2

In [7]:
query = '''
SELECT project_id, FORMAT(AVG(experience_years),2) average_years
FROM Project1075 p
LEFT JOIN employee1075 e
ON p.employee_id = e.employee_id
GROUP BY project_id;
'''
pd.read_sql_query(query, engine)

   project_id average_years
0           1          2.00
1           2          2.50

Note:

1. FORMAT(xx, 2) --> 2 digit. 
ROUND to 2 digits will not work on the integer or 1 digit number.